[{"title": "TIFU By asking a MILF for her number", "text": "So I was at the mall with my son, whose a toddler. Anyway my son was playing really well with this little girl.Like they where two peas in a pod playing together, just having a blast.Im a big dude, Lotta people say I look scary type look.Anyway my son is playing, Im eatting my lunch and I decide I need to figure out who this girls parents are.I figure it out, shes apparently a hot mom.So I walk up and go Hey our kids are playing together, maybe I can get your number and we can setup a play date she looks at me and goes um, married I was thinking thats nice, my son wants to play with your daughter so I said Me too, my wife would love to meet you, our kids are playing well together, do you wanna set up a play dateAt that point her husband walls up and she goes this guy is asking for my number after I told Im marriedAt this point Im thinking fuck it, not worth it. I apologize and sit down and wait for my son to finish playing.TlDr son was playing with a little girl, tried to get the girls parents info so we could setup a play date. Her mom thought I was trying to pick her up."}, {"title": "AITA for telling my sister that just because shes a social worker it doesnt mean she always knows whats best for foster kids?", "text": "My sister (30s) is a social worker. My husband and I (30s) are foster parents. We are currently long term foster parents (and possibly foster to adopt) for biological siblings. The siblings lost their sole parent a couple of years ago. They have half siblings from said parent who are much older, now adults to be exact. Our foster kids miss their half siblings and have craved a relationship with them. But the half siblings have chosen not to have contact and from the limited info we know about our foster kids lives before they came to live with us, any visits that were had while the half siblings were minors, it had to be forced on the older kids who did not wish to keep contact.This has been extremely difficult for our foster children and we have advocated for them to be in therapy, which luckily was approved and they go once a week. But they often ask about and bring up their half siblings and beg for us to set up time for them to see them.My sister is aware of this and has spoken out to my husband and myself three different times about how we need to do more to ensure this relationship between siblings. We have told her thats not possible. She told us we are failing our foster kids. She said we need to find out the info of these half siblings and fight for contact. She told us we could bring it to court if we need to. I reminded her thats not something we can do. She told me the kids will never see us as parents or want to be in our family if we keep them from their siblings. And then she went on and about how important sibling relationships are and brought up the fact shes a social worker and she knows how these things work better than anyone in the family.I told her that just because shes a social worker it doesnt mean she always knows whats best for foster kids. I told her she also has no control over adult decisions that are made. Which is something she should know as a social worker. She told me I should take her professional advice and stop invalidating her profession and experience like I did just there.AITA?"}, {"title": "Neighbor complains to HOA and the city without talking to us first", "text": "Sorry about the formatting I'm on mobile and don't typically post..We bought our first home, had a baby and moved in all at the same time last autumn. We bought a lawn mower and it broke before we could finish mowing our lawn this spring, money has been a little tight and we were not able to afford a service to mow our lawn nor were we able to afford a new mower. On top of this we've been more run down than usual because we got sick and both have chronic pain. It's also been raining heavily to the point that parts of our yard are just mud. We are well aware that these are not excuses, rather an explanation of the situation which is why we're working on our lawn as much as our bodies can physically handle. After about a month of not being able to mow we finally got enough for a new mower and it arrived on WEDNESDAY the 26th so we started with the front lawn, and received an email from the HOA AFTER we started mowing but didn't get the lawn finished Wednesday because our bodies gave out. Thursday we were out grieving a friend and that took all of our energy so we didn't mow. On Friday we got a notice from the city to mow our lawn. We suspect both complaints to be from the same neighbor, because a door to door salesman ratted him out to us, he was also trying to get us to switch to his pest company.  No neighbor ever approached us to ask what was up. Those who have approached us haven't ever said anything about our lawn. The rotten cherry on top is, the neighbor we suspect has seen us fighting with the lawn mower trying to get it done.I wish they would have come to us to ask what's up first, we get it they're established- we are still getting there.  .So cue malicious compliance... Neither notices said what pattern we had to mow in. It just said we had to mow it and to bag the clippings. Fine we can do that. We check the noise ordinance for the city and the HOA, there isn't one, PERFECT. We got up at 6 am on a Saturday morning, have breakfast and coffee on the front porch, and at exactly 7 am I started the lawnmower. We did a funky mess with curvy lines that make absolutely no sense ON PURPOSE. Next time we have to mow I'm doing a frowny face. ( Edit to add - we live in a neighborhood that is still in the process of being constructed, some of our neighbors haven't even had the weeds cleared out of their lot for sod to be placed yet. It's not for a lack of us trying, both of us are not able bodied people and we're doing our best. "}, {"title": "The sleepover that ruined sleepovers", "text": "\"I thought your parents were neat freaks.  They never let anyone come over.\"\"They are... but I finally convinced them to let me have a friend sleepover.  I'm so excited.  They said you can head over after dinner.  They promised to leave us alone.\"Hearing my best friend Gavin gush at the thought of having me over reminded me of just how good our friendship was.  Even though we were in eighth grade and probably should have been a little more mature, we were kids at heart, kids who just wanted to play video games and stuff our faces with junk food. If even a crumb fell on their living room carpet, I knew Gavin's parents would soil themselves.  So, I was a little nervous when I stepped foot into their house at half past eight on a Friday evening.  I brought all the fixings over for a fun-filled night and dumped them in the living room, cautiously sniffing around to see if I could hear Gavin's parents. \"They are upstairs.  Don't worry Myles.  They won't be coming down.  We have the whole place to ourselves.\"Gavin's face was as red as the spicy cheese puffs.  \"You okay, man?\"\"Yeah, I've just been running around all night trying to get the house ready.\"The house was eerily quiet I heard no movement upstairs.  As we settled into a multiplayer gaming session, every few minutes I would glance at Gavin, as his bulging eyes stared intently at the screen. \"Hey, you sure your parents are cool with this?\" I waved my hands around to get his attention, but Gavin's eyes stayed locked in on the screen.\"Hey man, you okay?\" I nudged his shoulder.Tears formed, and I knew something was off.\"You can come over every day if you'd like.  We can play games all night.\"\"Are your parents even home?  Is it okay if I go upstairs?\"\"No!\" Gavin shouted.I jumped up and raced upstairs with Gavin chasing after me.  I pushed open the master bedroom door and entered the crime scene.  Gavin's dad was sprawled out on the ground, a large kitchen knife lodged into his chest.  His mother, face down on a pillow, a pool of blood around her neck.Gavin blocked the doorway.\"Don't come any closer!\" I yelled.  \"I can't believe you killed your parents.  You are crazy.\"My throat sealed shut, body rattled uncontrollably.  Nausea kicked in.  I could not believe my eyes.\"They never even loved me, never paid any attention to me.\"  Gavin eyed me cautiously to see how I would respond.  We were both about the same size, so I didn't want to risk getting into a deadly shoving match with him.  I mean, for all I knew, he could have had a knife on him.I turned to the window and went for it.  Slammed through the glass and onto roof, tumbling and falling, eventually landing on junipers. When I woke up, I was resting comfortably in a hospital bed, my family by my side.  I found out Gavin confessed to the murder of his parents and was apprehended by a neighbor and the police shortly after I passed out.  It's been years since the incident, but as you can imagine, I've had trust issues."}, {"title": "AITA for not reminding my husband about a huge event in my life?", "text": "Im currently a PhD student and also work. Hence, Im busy. I made some changes to my project right before my confirmation seminar which Im only mentioning because my husband was well aware of my increased workload and pending deadline.I told him confirmation was rapidly approaching and he asked if he could come to the presentation. I told him I wasnt sure but would ask. Then the university sent out my presentation details email with a zoom link. I forwarded it straight to him. A few days go by and I realised he hadnt mentioned it. I asked if he read the email and he said no. I asked him to read it. A few more days go by, I asked him again to please read it. At this stage I realised that not only had he not read the email but he hadnt bothered to enquire about the presentation. Unfortunately this is fairly normal for him. He doesnt often enquire about much about me, ask me many questions about my day etc and I admit Im tired of being ignored. I could have reminded him the day of the presentation but to be honest I didnt want to. I wanted him to care enough to either ask or read the email. This is where I might be the asshole.Presentation day comes and I present and pass. He has no idea and still doesnt ask. After a couple of days I decided to finally mention it to him. He things Im the asshole for not reminding him. I think hes the asshole for not caring enough to ask.AITA?"}, {"title": "Children in the Forrest", "text": "As a new resident of Essex County Massachusetts, I was well aware of its horrifying history. Between Salem and Ipswich, I was fully prepared to tackle the colonies of witches and sea creatures of Lovecraft. Well, that's what I told my seven-year-old daughter. Being alive at this point in history has its upsides, such as having the highest life expectancy in human history. But there are also downsides, like having a daughter who has access to the internet. Since my divorce, Lyla has needed access to a phone. Despite my attempts at monitoring her online usage, she's smart. Going to be smarter than me one day if I do this whole parenting thing right. Not even twenty minutes after telling Lyla about the move, she came bursting into the living room demanding that we stay put here in Rhode Island. It's been perfect in the Ocean State for us. It's quiet, the grocery store, movie theater, gym, everything is just a short drive away, and there's a pretty good school system. However, finding work as an IT employee has been difficult. Even after submitting 50+ applications with nearly seven years of experience in the field, you'd think I would be swept up right away but that's not the case for me. So when I got offered a position for nearly 80k a year I jumped on the opportunity. Lyla has never had to move out of the state before. My partner and I separated about two years ago now and even then, we both moved no more than 20 minutes away from one another so that Lyla didn't have to move schools or adjust as much. Telling her that we'd be moving nearly two hours away was difficult, but in the end, she didn't seem to mind at the moment. If anything she seemed excited to help me pick out an apartment. No decision gets made without my little girl. But anyway, after our conversation and her eventual barging back into the living room, I had to convince her that no witches or eldritch beings would come to capture us in our sleep. Lyla's always been creative. She's either nose-deep in books or drawing with the special art pencils I got her for the winter months. After some quick thinking, it seemed like only a potion could keep us safe, so I quickly made my way to the kitchen to create a protection spell. Nothing some good ol' showmanship couldn't create. Some pink lemonade, ginger ale, a small splash of Tabasco sauce, and some fancy glasses would do just fine. I don't think the spice was all that necessary, but it seemed to create a nice little extra dash of realism that made Lyla's face pucker up when she downed the potion. Just like that, we were safe in her little world.We moved right at the end of June, I wanted Lyla to have the time to adjust to the new state and not immediately have to jump right into being the 'new kid' at school. Our new Townhouse was nice, it had two bedrooms and two bathrooms. Perfect for the two of us. The kitchen was spacious and the living room offered plenty of space for both of our random hobbies and activities. What I really enjoy is the amount of space there is behind the townhouse. There's a lot of natural beauty in the area with plenty of trails and bike paths to choose from. Lyla currently has the goal to become a soccer player, so having plenty of yard space proved to be a nice bonus for us both. I would never let her go out there unsupervised of course, but I'm home often enough that she doesn't complain. On the downside, there was the occasional field mouse that would find its way into the walls and the landlord would have to set out traps to keep them from causing too much damage.Like I said earlier, I was lucky enough to get an IT job at one of the local colleges. Im sure you could figure it out if you dig hard enough, but I'll try to maintain some level of privacy. The college has a daycare and youth program that gets taken out of our paycheck if an employee is interested in the facilities. Seeing as we now live a few hours away from Lyla's last babysitter, this was really the only option. Much to my relief, they had plenty of opportunities that she grew to be excited about. With my daughter taken care of I was able to focus on work. In all honesty, it was easier than my last job, had better benefits, and paid more. For a few weeks, things went great, perfect even. Lyla made some friends at the youth program and work was everything that I wanted and then some. Plus if I'm here in ten years, Lyla could pretty much become a student with minimal costs.It was a Thursday, the college semester wouldn't start until August so things were going smoothly in the office. Every so often I'd have to run to do a college-wide update to a few of our systems but other than the occasional issue with an account for a new incoming student I was free to explore other work-related endeavors on the clock. Because of a power outage, we were able to leave the office early for the day, only by two hours, but getting out at 3 is much better than at 5pm rush hour. Lyla is more than excited for the change of plans, when I propose we hike one of the trails behind our townhouse her response nearly deafens me with her shriek. On the drive home, I notice her furiously typing away on her phone, no doubt telling her friends back home about our plans. It's around 80 degrees but there's a nice wind that provides a nice breath of fresh air. The trail is almost entirely shaded so luckily for us we won't really have to worry about sunscreen. It's the moments like this that I live for really, everything I do is for my little girl. Each giggle, every smile, makes everything I do worth it. When we get home, we rush into the house to change into appropriate workout clothes. I cannot wait to take off my polo shirt and pants and switch them out for a loose shirt and shorts. Lyla waits patiently in the living room for me, nose deep in her phone not even realizing when I stand in front of her. \tI laugh and say, \"Seems like outside time is just what you need right now.\"\"Sorry Dad, I'm just texting with my friend right now.\"\"I'm just glad you have some friends to chat with! You meet them from the youth program?\" I don't want to be nosy, but it's my job as a father to be of course.\"Mhmm, his name is Jay. We met outside when Miss. Sara took us out for tag.\" She stands from the couch and leaves her phone on the small table beside her. \"I'm ready when you are Dad. You always take so long to get ready.\"I jokingly roll my eyes and this gets a giggle out of her and I'm soon chasing her to the front door. It's true, when we get home I take off my tie and just sit at the edge of my bed for a moment to close my eyes and take a few deep breaths. It's tough being an adult, sometimes a moment alone can be a lifesaver. Lyla runs ahead of me and I jog after her. I'm not really worried that she'll run out of sight. There's not really anywhere she could go off to, but even so, she always stays in my line of sight. We make our way onto the well-worn path and I take a nice deep breath of fresh air. Pollen coats the air and I can tell that flowers are sprouting up nearby, it just smells fresh and healthy out here. We go at our own pace and take in the surroundings. Every so often Lyla will ask me about a random flower that she sees or questions me about what type of bird might be calling. More often than not I don't have the real answer to her questions. But a good response of \"what do you think it is,\" more often than not satisfies whatever answer she is looking for.We must have been walking for close to an hour before we start circling back towards home. We didn't make it all that far in all honesty, but that just means we have less of a distance to walk back. The both of us have been quiet for a little bit, enjoying the peace when a sudden feeling of concern goes through me. I look towards Lyla and she seems to be doing just fine, balancing on a fallen log beside the trail as we walk back. I look around our surroundings and don't notice anything out of the ordinary. It's been a year or so since I've last had an anxiety or panic attack and by how fast my heart begins to beat I can tell that the exercise must have triggered something. I make sure to tell myself that I know exactly what's going on. My elevated heart rate probably just triggered an attack, there's no need to be concerned. It's a beautiful day and if I need to sit down I can sit down. I've told Lyla about this type of situation and what to do. Just take it easy, don't panic, be calm, and get an authority figure if needed. When I pull myself out of my inner thoughts, I'm caught off guard when Lyla isn't in front of me. I stop and immediately turn around, spotting her standing just off the trail and staring into the woods.\"You okay? What's going on?\" I try not to let my panic show in my tone. When she doesn't respond I walk over to her and kneel down. \"You good, sweetie?\" Her face looks pale like all the blood has drained from it. I fix my gaze to where she is looking but don't spot anything. \"What is it, you're starting to worry me.\"After opening and closing her mouth a few times she says, \"There were kids out there. But they-\" She couldn't finish what she wanted to say and finally turned to look at me. \"Daddy, I want to go home.\"That's when I knew something was really wrong, she hasn't called me that for a few years now. An immeasurable sense of dread washes over me. It feels like something is watching us. Occasionally, there are mountain lions and sometimes brown bears in the area, but this feeling is...something entirely different. I snatch up Lyla and she wraps her arms and legs around me, burying her face in my shoulder. I take off down the trail back towards home. \"Lyla, I need you to tell me if something is following us.\" I snap, eyes darting to each side of the trail.I feel her head move up and she immediately shrieks, \"Dad!\" I plant my feet in the ground and quickly turn around, ready for whatever it may be. My gaze tilts down and no more than five feet away from me are two small figures. Both of them young children, one boy and one girl, standing in front of me. Both of them looking no more than fourteen. It's like I can feel their presence as they stand unflinching. Right away I can tell that the dreadful feeling is emanating off of them in waves. They are both wearing long sleeves and pants with no definitive branding or anything on them, even so, with the skin that is exposed they look sickly pale in the shade of the trees. They are just children, they can't do anything to me. But then why am I so terrified? It's like I'm caught in the view of a deadly predator.\"W-what do you want? Are you lost?\" I ask. It's clear that they are the ones controlling the situation. At the same time both of them speak with a dull buzz coating their words. \"We lost our friend, have you seen her.\" Their voices don't have the tone of a question, more like they already possess the answer.\"We haven't seen anyone, it's just been me and my daughter.\" I force the words out of my throat. \"She can be our friend.\" They speak at the same time again, taking a step towards us. My eyes widen when I finally meet their gaze. Their eyes are an endless void of black taking in whatever sunlight dribbles across their orbs and reflecting nothing back. All I can bring myself to say is, \"No, she can't.\" My body is trembling and I can feel Lyla's nails digging into my neck. I hesitantly take a step back, keeping my eyes locked on the pair. When they don't do the same I take another. I keep walking backward, afraid to even blink and have them leave my vision. Eventually, I'm forced to and when I open my eyes they are gone from sight.\tWhen we make it back to the apartment I immediately lock the door and call the police. Each step away from where we saw the kids the feeling of dread lessens. I'm not sure what to tell the cops other than two lost kids were roaming the woods looking for their friend. I give them the best description I can but I can't bring myself to tell them about their eyes. The rest of the day goes without incident but that doesn't stop me from being on full alert. I wait for a knock on the door or for that horrible feeling to come back but it doesn't. The TV stays on the rest of the evening, I'm afraid of sitting in silence and I think Lyla appreciates it too. Even she stays in the living room with me the rest of the day rather than disappearing into her room. I don't even say anything when she gets lost on her phone.When nighttime comes around, I walk Lyla to her room and tuck her in, which I haven't done for the last few years now at her request. But for tonight, I can't say I blame her for wanting the extra security. I kiss her on the forehead and when we say our goodnights I leave her door open a crack so that when I sit on the couch for the rest of the night I can see the foot of her bed. 10 pm rolls around and instead of crawling into my bed, I make myself comfortable on the couch. I can't shake the feeling that something more is supposed to happen.Lyla saw the black-eyed children too so I know it's not my imagination. With the blinds closed and all the windows and doors in the house locked we are as safe as we could possibly be. Because we share a wall with the neighbors a good shout would be able to alert them if anything did happen at all. They were just kids, it's not like they could do anything.11 pm rolls around and I'm tossing and turning on the couch with the possibility of sleep seeming like a fantasy. Every so often I check on Lyla and she's fast asleep. I have to get up around 6 so I'm not looking forward to the lack of sleep I'll have for tomorrow, but I've done worse before. 1 AM rolls around and I am staring daggers into the ceiling. It feels like I'm next up to bat at the World Series and it all comes down to me. I know its all from earlier, but I just can't shake this nagging feeling of...I don't even know what to call it. At moments I even get the feeling that the police are going to come banging at my door under the pretense that I either kidnapped those kids or made up the whole story. It doesn't help that another field mouse must have burrowed itself into the wall because there's a slight scratching noise every so often. I'd rather deal with the mice than whatever this night was. Another episode of my show ends and I've given up sleeping at this point. I know I'll have to call out tomorrow but at the very least if Lyla was still interested in going to the youth program I could-- Tap. In the silence of the credits, a minuscule noise barely whispers into my ears. Tap. I wipe whatever fuzz could be in my ears and mute the TV daring for the noise to happen again. My heartbeat lightly drums in my ears but much to my annoyance and relief the noise doesn't happen again. I sigh, standing up from the couch. At the very least I could try and grab a book maybe and do some reading, anything that will help me with--tap tap tap. I freeze in place. It's not in my head I know I just heard that come from somewhere. I rush to the front windows and push them aside. Outside all I can see is the well-lit walkway outside the house and my pale reflection staring back at me. I let the curtain fall, trying to swallow the concern that's making me want to empty my stomach. There is the faintest sound of hushed breath and in the quiet of the night, it may as well be alarm bells. So, this is it, I think. This is how I finally go mad in this world. A sharp creak immediately brings me back. It was the sound of a window opening. I sprint to Lyla's room, cold sweat coming down my forehead as I push the door open. She's kneeling on her bed facing the window, curtains swept aside and frozen in place. She's opening up her bedroom window and for a few seconds, I see someone standing outside. The three of us freeze in place. For just a few seconds, we all pause looking at one another like deer in headlights. One immediate thing became clear, that was not a child outside her window, but an adult man. Before I can consciously make a move, my instincts take over and I rush over to the window. The man dashes away before I slam the window closed and lock it. Lyla immediately starts crying and I take her into my arms. Over the next few days, I quickly came to realize just how close I became to losing my daughter. The second week after we moved here, Lyla made herself a new friend at the youth program. His name was Jay and he was the groundskeeper for the college, at least that was his cover. Most days of the week Jay would come visit the college and make his rounds around campus, always making sure to say hi to his little friends whenever they were out. He'd wait and sit on a bench just outside of view from where they went out to play tag and get their outside time. He'd offer them little gifts or snacks, he always had a uniform on so he was a trusted adult. When I took Lyla's phone, they've been exchanging messages for weeks now. He'd send her photos of animals, message her goodnight...say things to her that make my skin crawl just talking about it. The night he came to the house, he told her that he'd be taking her to a special star-gazing event. She wouldn't be allowed in if she told me, no adults allowed it was something just for the kids...and him. The police were able to find the identity of who Jay truly was. His real name was Thomas and he wasn't a groundskeeper at the college. He was a failed farmer who lived on the outskirts of the state never holding down a job for too long. They raided his home but it was empty by the time they got there. He had a barn where police found evidence of other kidnappings, but they were never able to find what he did with the other children he took or how many children he ended up keeping there. \tHe knew everything about our schedule, when we left, when we went home, what days of the week I had off, he knew about the divorce. Everything needed to steal my baby girl away from me. He would have succeeded. I would have lost Lyla. I would have never seen her again.... if it weren't for what we saw on the trail. Safe to say, Lyla's phone got taken away. She got a long lesson from both me and the police to never do what she did again. The scary thing is I don't know if that'll be enough. Her school issues out laptops for its students to complete homework and take care of school work. She eventually will need to have her own phone again and social media is its own horror story. After that night, I didn't trust Lyla's safety again in this house so I asked for my Ex partner to take her until I could move away and find another job. I just can't shake this nagging feeling that things will never be the same again. If it weren't for those kids we encountered on the trail Lyla may not be alive today. I just have this feeling that something even worse is waiting for me with each passing day."}, {"title": "AITA for expecting my girlfriend to reimburse me for an item her mother lost?", "text": "For some context, I have recently gotten some custom fit orthotics on the NHS to hopefully relieve some of the pain I get in my ankles and feet due to me being flat footed. I can only bare them for a couple of hours a day at the moment as I am still getting used to them.I am currently on a getaway with my girlfriend and her family in a caravan park. Last night after we had been out for a couple of hours my feet started to really hurt, so my gf told me to remove the insoles from my shoes and she will give them to her mum to keep safe in the pram, so I did this thinking that this would be okay. This morning I asked my girlfriend is she could get them out of the pram for me and they wasn't there, we looked all over the apartment and they wasn't there either. So it's looking like they've been lost. Naturally I am pretty annoyed about this because you only get one free pair on the NHS and now I will have to pay for another and they are quite expensive.  Instead of understanding why I'm annoyed my girlfriend just said \"I didn't tell you to put them in the pram\" basically implying it's my fault they got lost because I let her put them in the pram. I then reminded her that actually she put them in the pram which I allowed her to do because I trusted they would be safe there since she said they would, she then responded to this saying \"yes but you still made the choice to let me put them in the pram, you didn't have to take my advice\". Her family also said that I must not have cared about them that much since I didn't check to see if they were still there until the morning.At this put I felt really confused and distorted and I lost my cool and blew up at my girlfriend, which i later regretted. I felt manipulated and felt like she was trying to not take accountability and instead deflect blame onto me. In the She said that she would pay for them even though she shouldn't have to because she didn't lose them to which I responded agreeing, saying that her mum should pay for them, but that won't happen as my girlfriend is too scared to say anything to her mum. AITA?"}, {"title": "my aunt sent me a letter in the mail. i think theres something wrong with my town.", "text": "Hello, reddit. My name's Adam. I'm 18 and a senior in high school. Recently, I've been asking my Aunt Brandi about what colleges I should attend. (she's a family law attorney and for reasons i won't get into here, i would like to do the same thing) Brandi and I usually text or call, so I was a bit confused when a letter from her appeared in an envelope addressed from Vanderbilt. I am posting this here because I don't know where else to go to get this off my chest without raising too much question from my peers and fellow townspeople. I'm not sure what this means for my family or friends, but as soon as I get my diploma, I'm leaving this town. ***** (the letter begins here)**I didn't deserve what happened to me. I know, that's a bit egotistical. But really, I wouldn't wish it on anybody. Aside from the injury, I was... seeing things. For weeks, I felt reality escape my mind's desperate grasp. The lines between what was real and what was an image conjured by my false perception of reality have blurred over the years.You know that I could hardly wait to get out of this small town. Don't get me wrong, Hallowville is a cute little dot on the map I had assumed was worth visiting, but at this point, I had been living there for seventeen years. I was beyond ready to go. I didn't have dreams, I had plans. I was gonna graduate as the valedictorian out of seventy two students, then I'd go to Harvard and study law. Once I had enough money, I planned on moving my family out to Massachusetts with me. This all happened in 1998, so you'd think I wouldn't remember any minute details but... I can still feel the saw's jagged edges going through my skin and the vibrations proliferating in my entire body as the metal hit my bones...It was the summer after my senior year. I had already gotten accepted into Harvard, and I was just trying to save up as much money as I could. Even then, renting an apartment out of state was a huge hassle. Aside from babysitting, walking dogs, and mowing lawns, I had a \"steady\" job as a host in the only restaurant in town, Timberwolf Lodge. \"Heather, can you seat this next family?\" I asked the curly haired blonde girl. She raised an eyebrow, chewing her gum behind the counter. \"Why can't you?\" there was spite in her voice. I would have been mad if she hadn't already been covering the only other host, Nicole's, shift. None of us wanted to be there, but working was the only way to get through life.At this point, I had already begun to remove my apron, relying on the off chance that Heather wasn't already fed up with the nagging customers of the evening. \"I.. I'm off in two minutes. My birthday party is in an hour.\" \"It's your birthday?\" Heather stood up. \"Brandi, why are you working?\"\"Nicole's sick and I didn't want you working the rush alone,\" I told her.Heather let out a scoff. \"At an Olive Garden, maybe. But we get like five families during our \"rush.\"\"I grabbed the notepad and marked the time. \"Thank you so much, Heather. I owe you.\"\"I know. Happy birthday!\" Heather waved me out.As I left the building, cold rain drops fell upon my skin. A chill ran down my spine, but I smiled regardless. Besides the fact that it was my birthday, gloomy weather was my favorite. Living in central Texas, I was no stranger to humidity. But this storm was fresh, crisp. There was no heat lingering in the air, as though Mother Nature herself played a part in planning my birthday party.In the parking lot, I spotted a brand new black Chevy Impala. With a smile, I strolled over and spotted a young man sleeping, his messy black hair pressed against the window. I brought up my fist and knocked on the glass. \"Are you loitering, sir?\"The man stirred awake, his eyes meeting mine. He rolled down the window, a relieved smile on his lips. \"There she is!\" I heard the melodic sound of love ring in my ears. \"My gorgeous birthday girl!\"I leaned in through the driver's side window, stealing a quick kiss from my boyfriend of nearly two years. \"What time did you get here?\"He shrugged as I made my way around to the passenger's seat. \"Like.. an hour ago?\"I buckled myself in, letting out a breath I didn't know I was holding. \"We should be home with enough time to get dressed and set the table if Angie hasn't yet. Is the ice in the trunk or did you drop it off at my house?\"Matty spared me a sheepish smile. \"I may or may not have forgotten.\"\"Matty!\" I scolded, looking over my shoulder to check if he was joking or not. \"You had an hour of nap time to get it!\"\"I'm sorry, I had to pick your.. Something up and it slipped my mind,\" he put his hand on mine. \"Really, I'm sorry, Brandi.\"\"It's okay, it's okay, really,\" I let out a sigh, taking out my pager. \"I'll let my sister know.\"\"I already paged her,\" he shook his head. \"We knew you'd need a couple hours of leeway, so we pushed the party back.\"I felt a mix of relief and frustration wash over me. \"Why didn't you tell me earlier?\" Matty smiled, shrugging. \"Youll find out in a couple minutes.\"I furrowed my eyebrows, could he be any more ominous? I stayed quiet, both nervous and excited for what he had planned. Matty had never been the most adventurous kind, but perhaps it was because his mind was constantly off in other worlds. Matty was an aspiring author, and he too would be going to New York for school. Granted, we would be a few hours away from each other, but it was better than being halfway across the country. My eyes fixed on a small, still figure in the distance. I squinted, noticing a familiar car on the side of the road, its hazard lights periodically illuminating the rain. \"Is that Mr. Rinefer?\"Indeed, on the side of 77, a seventy something year old man stepped out of his 1956 Ford F100. Mr. Rinefer was a tall, lanky man with wire-framed square glasses that sat on the tip of his nose. He wore a pale blue glare through them to indicate how superior he thought he was. He had a large slouch from grading papers at his old age, displaying his complete disregard for his appearance. His gray-white hair was naturally slicked back, resembling a 1950's greaser.\"I could never be a teacher,\" Matty said, his eyes following Rinefer as we drew closer. \"Poor guy doesn't get paid enough to afford a new tire.\"\"Should we help him?\" I asked. Sure, there was a creepy aspect about his demeanor, but he was a nice guy nonetheless. I pushed down my inherent fear of older men whenever we faced each other. I could never bring myself to let my eyes meet him, and when they did, I felt my heart drop and stomach curl. Despite his appearance, Rinefer was a great teacher. Without him, I wouldn't have passed AP Biology. Matty paused for a moment, slowing the car down against his better judgment. \"Damn it- Hey, Mr. Rinefer!\" he cheerfully chirped as he rolled down the passenger side window. \"Need some help?\"\"Matthew!\" Rinefer greeted in was that displayed his hidden embarrassment. He cleared his throat. \"I think I'll be okay.\"\"Are you sure?\" I asked him. \"Wouldn't you wanna wait out the rain?\" Rinefer was a stubborn old man, but surely he wouldn't risk his safety for his pride. \"I'll be okay, Brandi. The rain is on my side. You'll find out why at the center of the earth.\"\"Um... okay,\" Matty nodded. \"Bye, Mr. Rinefer.\"I just smiled and waved, rolling up my window. I furrowed my eyebrows and looked at Matty. \"Do all old people talk in riddles?\"Matty shrugged. \"The man's ancient. He probably invented riddles.\"I shifted back in my seat, looking out the right hand mirror. Mr. Rinefer was resting against his car, his face tilted up towards the clouds. \"Mhm.. Freak.\"\"You're the one who wanted to stop,\" Matty reminded.I pursed my lips as the old teacher disappeared from view. \"I hope he'll be okay... I wish we knew someone to call for him.\"\"He's made it first. I'm sure he'll be fine. Now, close your eyes,\" he told me, slowing down. I didn't bother objecting, my trust completely laid in his hands. I let out a breath as I heard Matty's panicked rustling beside me. \"You okay?\"\"This isn't how it was supposed to go...\" he groaned.I couldn't help but open my eyes. I looked out the windshield, through the rain. There was a red and white checkered blanket, held down by four stones on each corner. Pillows and blankets and roses, now all drenched in rain.I smiled and turned to Matty. \"It's... it's a sweet sentiment.\"\"I put up a canopy, I swear,\" he took my hand. \"I guess I underestimated the storm.\"\"Hey, we can have a picnic in here,\" I kissed his cheek with a wide grin. When I sat back down, I noticed Matty shake his leg, his hands in his lap. Something was bothering him. \"What's wrong?\"His eyes flickered from me to the window. \"I drank a lot of Mountain Dew when I was waiting for you.\"I let out a snort, covering my mouth. \"Sorry.. Just... Go. And be careful.\"Matty nodded, grabbing a small bottle of hand sanitizer as he traveled into the woods. I hadn't noticed that the rain was even worse here than on the road. I hoped Matty would stay safe, and be quick. I bounced my knee as I waited for the boy to return. How romantic. I looked out into the unfamiliar woods. I knew many kids had gone to this clearing before. Our very own Lover's Lane. Even then, it was a cheesy cliche. I was sure that some movie buff saw it in theaters and chose to replicate it. After some time, I averted my gaze into the direction Matty had gone. I looked at my watch, it had been nearly ten minutes since he had left. Scenarios played out in my head, I was unable to see the tree that Matty disappeared behind. I rolled down the window, squinting my eyes to make out silhouettes in the rain. I thought I saw a figure, who looked about Matty's size.\"Matty?\" I called out to no response. I let out a breath and opened the car door. The wind whirled around me, whipping heavy rain into my face. With a groan, I continued into the woods, looking back to the sanctuary of the car behind me. A part of me was rationalizing why Matty was taking so long, but my anxiety got the better of me. My steps were heavy, mud already forming on the earth's surface beneath me. I walked deeper into the woods and found something odd. At first, I thought it was a cabin, but upon close inspection, it appeared to be a tight-knit ring of trees acting as a barrier. I circled around the trees, looking for some sort of entrance. I found a thick set of vines that, though heavy, could be pushed back to walk through. I stepped through the vine, the atmosphere instantly shifting. Though the rain was dense and the wind was coarse, it seemed as if this ring of trees was in an entirely different space altogether. I could still see the dark clouds above, but the leaves were so tightly packed together that rain only trickled in in certain spots.I furrowed my eyebrows, unable to fully comprehend the setting laid before me. A well. A wishing well with a square stone base. The top of the roof was at least six feet high, and when I got closer, I realized why it was so big. A metal trapdoor was open, revealing steps leading downward into a dark abyss. I focused my eyes, the faint glow of flickering candlelight at the bottom.I felt my heart drop at the eerie sight. \"Matty?!\" I called down.The wind and rain stilled. A sinister silence plagued the clearing. I'm not sure if I was tuning out everything else, or if every creature on earth decided to quiet, but I didn't hear a single whisper. It was as though nature itself paused.\"Brandi?\" The word sent a chill down my spine. Something about that voice was desperate, but as I recalled it in my mind I couldn't discern its source. The voice had to be Matty's, but it felt angry, injured.\"Matty, are you okay?\" I called down. He didn't respond. I took a breath, looking down the stairs. The stairway itself was dim, but there was a light at the bottom. \"Matty?\" my voice was small, pleading. I was waiting for him to run up the stairs, laughing at his sick and twisted attempt at comedy, but he never did. I heard a loud, earsplitting screech. I let out a groan and ran back to the car, grabbing a flashlight. As I shut the door, a wave of regret washed over me I had left the keys in the car. I reached my hand through the rolled down window, opening it up from the inside. The alarm suddenly blared in my ears, the hazard lights flashing, momentarily illuminating the heavy drops of the downpour. I frantically pushed the unlock button, but the alarm would not stop.With a noise full of frustration and anxiety, I ran back to the ring of trees. I pushed past the vine, sharp leaves leaving paper like cuts on my arms as I shielded my face. I swallowed and turned the flashlight as I approached the well. I looked down, illuminating the steps below me. The stairs were made entirely of stone, its creators not bothering to smooth the jagged edges down. I carefully stepped down, my steps echoing through the hallowed tunnels. As I neared the bottom, I realized the flickering I saw was from the many sconces lining the stone walls. I looked around, pointing my flashlight through the dimly lit hallway.I noticed a nearby archway, leading to a room lit by a white light. As I approached the room, the scent of bleach and other chemicals burnt my nose. I brought my hand to cover my nose as I entered. It was another tunnel. This one was wider, and lined with metal doors on either side. I brought my flashlight up, trying to see the end of the tunnel. Before I could spot the end, I felt a pair of hands wrap around me. I struggled in the sudden grip, every defense mechanism kicking in. A cloth was brought to my mouth and I tried my best to hold my breath, but my body acted against my wishes. I took in a deep, deprives breath, the ancient stone around me disappearing completely.When I woke up, I couldn't move. There were no restraints, but some invisible force was locking me down onto the icy steel table beneath me. There was an immense pressure plaguing my entire body, particularly my chest. I could barely breathe because of a burning sensation in my throat. Steps echoed in the empty halls. My head reeled as I tried to turn my head to see where the noise was coming from. The air became thicker as my breath became rapid. I was stuck in a body with total loss of control. The steps became louder and I heard it again, the screeching. It wasn't until then did I realize that it was the thick, metal door. I tried to scream, but felt the burn in my throat worsen. Hot tears trickled down either side of my face like melting candle wax. I felt like I was breathing through a piece of cloth, no amount of desperate, deep breaths could calm me down. I knew I should have steadied my breath but there was no point. I was going to die on that rusty operating table.The footsteps came to a stop right beside me, just out of my peripheral vision. The sound of a drill drowned out my thoughts as the figure dressed in white walked down to my hips. He looked me in the eyes, and though his mouth was covered with a surgical mask, the manic crinkle in his eyes gave away his true level of lunacy.When the saw first touched my skin, I thought that maybe he was just bluffing, a sadistic sort of play date. But when he broke skin within the very first slice, I knew that this was no joke. People say that your adrenaline spikes when in danger so that you can not feel pain as intensely. But I felt it. I felt every single movement in that jagged, rusty saw. I wanted so desperately to scream, to cry, to plead, to anything. But the possibility simply wasn't there, the fire in my throat roaring over any attempt at noise. I settled for muffled groans as the saw went deeper and deeper into my thigh. My breathing didn't even hitch, I couldn't control it. The pain was gut wrenching, and I could do nothing to stop it. I couldn't stop it. As the saw touched my bone, I saw stars. I felt my body twitch and I passed out once again.When I woke up, my entire left leg was gone. The room was still, the air thick with the scent of metal and bleach. I was gaining consciousness faster this time, the aching pain from my leg shooting up my entire body. I reached out towards the scalpel on the table, the smallest sense of safety and hope rushing over me. But the cart rolled away, and the body of the Doctor came into view.He was carrying my leg. I saw it sit stiffly in his arms, a stolen trophy. He set it down on a metal table, grabbing a nearby rusty wheelchair. He turned back to face me, the manic glint in his eyes ever present. My hands fell to my side once more and I lay still on the table, a corpse ready for examination. As the doctor came close to my right side, he clicked the wheelchair in place. Where was he planning to take me?  He pushed a piece of my hair away from my face, his cruel, ungloved hands were rough and calloused. He leaned down and brought his masked face near my neck, his body hovered over me. The Doctor sniffed in a breath, an animalistic noise filling my ears.My hand shot up, digging the car keys into his neck. The Doctor let out a pathetic cry as blood sprayed onto my face. I closed my mouth and yanked the keys out, stabbing him once again. His body slowly fell onto mine as I continued to stab his neck over and over again, only stopping when his body slipped to the floor. I looked down at his limp body, the image hasn't left my mind since. I sat up, my head pounding.I pushed the wheelchair forward, squeaky wheels echoing throughout the narrow stone halls. I hit the base of the stairs, projecting onto the steps in front of me. I felt my arms scrape against the un-chiseled rock, pushing the pain out from my mind. I was this close to freedom, I couldn't let a little blood stop me. I crawled up the stairs at an agonizingly slow pace. I kept thinking I heard footsteps behind me, but if I did, no one would take me.I fell out of the well, rolling on the ground. I still didn't feel safe. I dug my nails into the earth below me, my mind and body for the release of both my physical and mental anguish. I was close, so close to the vines. I saw red and blue flashing lights, my salvation was mere yards away. I reached my hand through the vine, the leaves denying my exit. I clawed at the hanging plants once more, but my shaky hand could not penetrate the barrier.Then the hand of Death reached out for me. Pale, boney, and welcoming. I accepted, my fingers grasping his. Both hands wrapped around my wrist and pulled me out. The rain had stopped, but the grass was still damp. I rolled onto my back, taking heavy breaths of relief. I did it. I made it out. I looked up at my savior, my eyes meeting his pale blue gaze.\"Mr. Rinefer,\" I cheered, though it probably came out as a rasp. My throat was still burning. I reached my hand up, realizing there was a large gash through it. Thankfully, the cut was shallow, but it was deep enough to temporarily damage my voice box. Mr. Rinefer sat beside me on the ground as the police officers spoke to me, the EMTs readying the gurney. I couldn't speak, only communicating through nods and head shakes. When we got to the hospital, I was given a pad of paper to finally give my full story.The police told me it was all a hallucination. They said that, yes, there was a staircase in the well, but it was abandoned long ago. Apparently, I slipped and hit my head and passed out. During the fall, my thigh scraped against a rusty barrel and they had to amputate my leg due to infection. The hospital even had the paperwork to prove it. Stewing chemicals created a biohazardous gas that induced the hallucinations. That alone was strange, but what they told me about Matty sealed my suspicions. \"Matthew Boyd's body was found floating in the river with blunt force trauma to his head,\" Sheriff Shaw told me, his hat in his hands. \"We're sorry for your loss.\"\"Blunt force trauma?\" I repeated, not sure if he was being serious. \"Who hit him?\"\"We assume he went to the river to relieve himself, as you told us, then he slipped, hit his head, and fell.\"\"Are you fucking kidding me?\" I questioned, anger seeping through my broken body. The medication the doctors had given me to help with the pain of my leg didnt help much. \"You gave us both the same cover story? Attacked by a pack of wolves is more believable than two, perfectly balanced teens slipping and hitting their heads enough to at least pass out.\"Shaw stood up straight, placing his hat back onto his prematurely balding head. \"You're still in shock.\"No fucking duh.I didn't speak to anyone else after that, not even my family. I don't know what he was covering up, or who he was covering up for, but with the help of Mr. Rinefer, I got the hell out of that town the next week. And you should too Adam. Luckily, you don't have any siblings. I suggest that you lay low until you graduate. As soon as that diploma's in your hand, you get far, far away from there."}, {"title": "AITA for kicking out my sister for calling me a bigot when I was getting married?", "text": "**EDIT**If believing that people have the right to marry any consenting adult they want without being shamed for their life choices makes me a bigot, I am happy to be a bigot. Asking people to date or marry someone based on who *you* want is slavery. I refuse to bow down to the pitchfork mob._________________________________________________________________________________________________________I am an Indian-American. My sister was homeless a while back. I asked her to live with me. I told her I am not taking a no. You are my sister and theres absolutely no way Ill allow you to be homeless.She told me that she cannot pay the rent. I replied with You think I am narcissistic enough to charge money from *my own sister?* You have the exact same rights to the house as I do, its yours. I want you to live with me for life.But there were three conditions first, no indecent clothes. Second, no cow-meat. Third, no swearing in usual circumstances. I personally cooked food myself or ordered it, she can just say what she wanted.Days later she did wear indecent clothes. I reminded her and said its her choice as to what she wears. Shes still my sister and so I didnt kick her out.Now I am getting married and its arranged. When she heard about it, instead of congratulating me, she said You were really trying to get someone from the same caste, I am sorry that you are a bigot. I was shocked and asked what that was supposed to mean. Her response Just that you turned down the dozens of women who wanted to marry you because they were of a lower caste. I cant believe my brothers a bigot.I stared at her and said You are leaving my house immediately.She screamed and began to protest, saying that I am an asshole and a bigot, etc. In the end she left, but other relatives are calling me the asshole now.AITA?"}, {"title": "AITA for not having my wife buried next to her long deceased husband as my stepson desired?", "text": "My wife died three months ago suddenly after 9 years of marriage. I was in charge of her funeral arrangements. We had one daughter together (f8) and her two kids from her previous marriage (m16 and f14) that I adopted. I had discussed her burial spot with my stepchildren and told them I wanted her buried in my family plot where I intend to be buried one day. My stepson said she would've wanted to be buried next to his biological father and her previous husband who died 12 years ago. My stepdaughter said she didn't care either way. I didn't want to disagree with my stepson on something like this so I looked into the cemetery where her previous husband was buried but found out there's only one adjoining plot next to his grave and no plot adjoining the adjoining plot, meaning that I can't be buried there one day. I told this to my stepson, that I can't bear to not one day be laid to rest beside her. I know she loved her previous husband deeply, but she loved me as well. And I've only ever loved her and only ever will. He didn't agree and said she had always hoped to be reunited with her previou husband. We were at complete loggerheads over this but in the end it was my call and I made it. He was so upset with me and still is. He earlier said he needed time to get past this and now says he needs me to apologize. My stepdaughter thinks we shouldn't be having this fight because it doesn't matter what happens to anyone's body once they die. I want to apologize to him but I don't think I'll mean it. Even now I think it would've pained my heart so much if I'd listened to him. "}, {"title": "AITA for not waking up earlier when my boyfriend made me turn off my alarms ??", "text": "My boyfriend (M25) and I (F25) had plans to go to a stately home today and have a picnic. I take my antipsychotic quetiapine at night and it works as a sedative. That shit knocks me the fuck out. The only way to get myself up is to blare alarms into my ear every minute for about half an hour.So I set my alarms starting at 10am this morning. Before they can unzombify me, boyfriend asks me to turn off my alarms as they are annoying him. So I turned off my alarms. Fast forward to 12pm, I'm still asleep. Boyfriend comes to wake me up and I can tell he's slightly peeved that I haven't woken up sooner. He pretty much wants me to jump up and start the day. But I haven't had my alarms blaring in my ear for half an hour to kick start my wake up. I still feel completely sedated and am unable to communicate properly. He's upset I'm not more apologetic and rushing to get ready. He's upset with me that I didn't 'wake' myself up sooner because I knew we had plans. I'm unable to wake myself up anymore because of the meds. That's what the alarms were for. He says I should've set more alarms for later? Forgive me for lacking critical thought while I am literally asleep. Also wouldn't that have been equally as annoying? Just later? He's now really upset because he feels that I'm not talking any responsibility for our day being ruined. Am I missing something here? "}, {"title": "AITA for influencing my niece into bad habits?", "text": "I (30f) am currently staying with my sister (32F), her husband (35M) and their two daughters Amber (11) and Rosie (7) as my company put me on a temporary secondment near where they live. I consider myself to be a feminine woman. I love dresses, makeup, high heels etc. However, I do not shave my legs. Not for any particular reason. I dont do it to make a statement or to fight the patriarchy or anything like that. My sister and I have thick, dark leg hair (dads side of the family is arabic) so our mother (who is white english) insisted we start shaving as soon as the hair started growing. But it always felt like something I had to do rather than wanted to do, so I stopped when I was about 16-17. Amber and I have bonded over fashion. She loves my dresses, tries on my heels and Im teaching her my more creative makeup styles. Im seeing someone at the moment and went for dinner with him last night. Its warm here so I wore a dress with my legs bare. Amber always comes to look at my outfits before I go out. She knows I dont shave but has never brought it up before. However, shes recently started shaving herself. When she came she asked me why I do my hair and makeup and dress up but dont shave. She said she thought shaving was part of the whole dressupget ready routine for girls. I just shrugged and said theres more than one way to be a girly girl. My date went well, but when I got home my sister was waiting for me. She said Ive been putting ideas in her daughters head and that now Amber is asking if its OK if she stops shaving. She warned me that if I try to influence her daughter I would be kicked out.I dont think I did anything wrong. I didnt even say that Amber shouldnt shave. All I said was that its a persons individual choice whether they do or not, and that it wouldnt make her any more or less feminine. AITA?"}, {"title": "The hot guy in the next apartment block asked me out. Now Im terrified. Part 1.", "text": "It all started with the damned dog. At least I want to believe that's when it started. Because the alternative - if it isn't just all one huge coincidence - scares the life out of me.Well, anyway, it was the stupidest way you could think of to get acquainted with someone - and I managed it. Not deliberately, of course. I was just hurrying to get indoors to my apartment as usual, carrying my usual baggage when the dog came running over and barked up at me ecstatically, capering round at my feet. And in the clumsiest fashion imaginable, I managed to trip over the damned thing, and instantly wished myself dead. In fact, I could quite easily have died of humiliation then and there.There I was, sprawling over the ground with my bag and books strewn all over the place and that goddamned dog now actually trying to lick my face through my hair which had spilled every which way, like the rest. Pretty undignified position to be in, right? And not just tripping over any dog, but a dog belonging to the hottest guy I could remember having laid eyes on in quite some time. Well, presumably it belonged to him. He was always taking it out for walks anyway. I would always see him going to and from the apartment block next to mine. And now, although I'd been giving him covert admiring glances for weeks this was the first time he'd acknowledged *my* existence, as he came hurrying over with a stern reprimand for the dog and apologies for me. And before I knew it he was beside me helping me up. I got to my feet in a daze while he began to pick up my scattered things apologizing all the while. 'I'm so sorry. Are you OK? Jessie, sit!' he added in a tone which brooked no denial. Jessie sat down at his side, tail wagging unceasingly.I began to come to myself. 'Yes, I'm fine, honestly. No need to apologize. Really.' I almost grabbed my stuff from him. 'Thanks.' I was aware I was blushing furiously but I couldn't do anything about it. I had never even imagined I would ever speak to him. He still hung around with an air of concern. 'She just broke loose. Jessie. She's still a puppy,' as if I'd asked for an explanation. 'You *sure* you're ok?'Why was it so hard to believe? Did I really look that awful? Come to think of it, I probably did. Too lonely and self-pitying, was my trouble. No boyfriend to speak of, not much family hardly a social circle at all, in fact. And then this completely gorgeous guy all of a sudden fussing around me on account of a complete accident.Or was it? Was it an accident? Anyway, that's how it all started. I never *really* expected anything further to come of it, of course. He was no doubt relieved that the plain clumsy girl from the next block hadn't actually injured herself falling over his unruly pet and of course I was similarly relieved that I hadn't managed to hurt his dog by landing on top of her or something. Basically, we were just thankful that neither of us had cause to sue the other, I guess, and that's as far as I ever expected things to go. But next time I saw him coming from his block, when I had just emerged from mine, he actually made eye contact, smiled and said hi. And that's how it always was after that. Seemed like I couldn't just slink past him any more trying to make myself invisible and all. Finally, he'd noticed me. And though we hadn't actually become friends or anything as yet, I felt somehow that was going to happen too.And that set the alarm bells ringing. It *did* happen -just a week after that memorable first meeting. This time, when I ran into him outside my block, he not only smiled but initiated a proper conversation. And I felt it was just too rude to rush off leaving him still talking, or something. So I stood there, trying not to fidget nervously while he introduced himself as Noah and revealed, as I'd long suspected, that he was a college student like myself. Not the same college, though. I nodded and smiled  but even though I was scarcely contributing to the conversation he didn't seem put off. And he rang off with one of those bewitching smiles of his which left me in such a daze that I started back to my apartment before remembering that I'd just come out. I couldn't even remember what he'd said his name was. Noah, or Nathan, or what? Hell, I just hoped I'd remembered to introduce *myself.* Things have really spiraled since.Makes it sound like a disaster, right? Whereas, on the face of it, it's anything but. Noah and I are going together now, pretty much. I mean, it's still not totally official, or anything, but we're meeting up for coffee and lunch and stuff (with or without Jessie). And he's casually let slip that he recently broke up with his girlfriend Brianna while I have been as unattached as it's possible to be in recent years, like I was saying. He seems to enjoy my company and I can't pretend that I don't enjoy his, at least when I'm making an effort to listen to what he's actually saying and not just being mesmerized by his eyes and his smile, *and* the rest. Sound like a particularly cliched romance novel, don't I? But my biggest fear is that actually it's all heading towards a very different genre. The horror genre, if you will. That's why I'm posting here, for God's sake. While I wait for things to unfold.I just can't rid myself of the feeling that it's all unnatural, all this. Looking at it objectively, the whole situation is bound to raise a few eyebrows. Because, put simply, I'm no looker and he sure as hell is. Well alright, I'm not downright ugly and I don't think I'm putting myself down unnecessarily, but I'm just trying to be realistic. What the hell does he see in me?I have to try and think it out.Is he still riddled with guilt over the fact that his dog tripped me up and he's still trying to make it up to me? Well, ok, that's pretty ridiculous. That can't be it.Does he like me for my brains? Again, I'm not stupid but I'm not especially smart or anything, either. I don't have a lively glowing personality and as far as I can tell we don't even have many of the same interests. One or two, like certain books and stuff, but not much beyond that.And yet he insists on us meeting up quite regularly now, and while we haven't actually kissed or anything, yet, something tells me that's not far off either. Unless I break it off completely from my side. But I don't think I'm capable of that. He's too good looking, and I've been alone for too long. But my feeling of unease never quite leaves.*Is* there something more sinister behind it all? Like, is he really an unsuspected serial killer, and a shy lonely girl like me is easy pickings? Maybe he's a *budding* serial killer and just wants to practise on me first?Even more ridiculous, right?Or what if he's just at a point in his life when he's totally bored for whatever reason and is just having some fun with me for a while before he drops me like the proverbial hot potato.And why am I catastrophizing so much, you might say? I might as well enjoy it while it lasts.But I can't. Not really. Like I said, it's - unnatural. Things like this don't happen to someone like me, in the ordinary way of things. Life is not a goddamned romance novel. Miracles like this don't happen. There has to be a price.I know there will be. Because, after all, why has this happened - *now*? Well, finally it's official.We're an item. And he still hasn't murdered me and his ex hasn't come back swearing vengeance and nothing has dropped on my head from the sky. Well I did have a bit of a ding with my car the other day of course, leaving a pretty sizeable dent in front and some most unwelcome repair bills, but that's all. I wasn't in the least bit hurt although I was shaken. I honestly thought for a moment that this was it, this was the price I had to pay for all my impossible good luck in snagging (was that really what had happened??) a guy like Noah. But the worst thing to come out of it was having to work extra shifts at the diner where I've been helping out for a year now. That's one place I don't think I'll be staying much longer. Shelley, my boss, is becoming pretty damn unbearable. She's *always* been unbearable, in fact. I can't even think why I've stuck it there so long. No initiative I guess. But I have to get out of that kind of mindset now. Now that I've got Noah.But I'm terrified I don't have him. Not really. That it's not going to last. And that something terrible is going to happen. If not to me, then to him, or .... And it's finally happened. The reason, surely,  why I've been feeling all this dread.When I went into work for an extra shift yesterday, at the beginning of the weekend, the place was still shut. They let me in, of course, as an employee, but everyone was standing around crying. Well, Denise and Kayleigh, anyway, while Tom and Jeff looked grave.'Didn't you hear?'What?'It's Shelley.'My heart dropped.'She's ... she's dead.'In a fog, I heard the babble of voices, saying what had happened. When she'd been driving home late last night. An accident. Seemingly a hit-and-run. No trace of the perpetrator. She'd died in hospital, early this morning.'It can't be true,' I cried out wildly. 'It can't.'They all looked at me curiously, like they thought I'd killed her, or something. And my greatest fear is that I did. Or as good as."}, {"title": "AITA for smoking food in my garden?", "text": "Ive (30s) recently bought my first house, Im the middle terrace in a quiet family area. Ive always been interested in smokingBBQing, and now that I have my own place I bought an American style BBQ smoker. Ive been watching shows and YouTube videos about it for years and have been really enjoying my new hobby.Over the last 4 months Ive used my BBQ for a long smoke (around 7 hours) 4 times. The garden is quite small, about 5m x 9m and I usually have the BBQ quite close to the house.My plan for this weekend was to smoke a brisket. I went out to start the BBQ at 8am for a 10 hour smoke when my neighbour asked from over the fence how long as I was planning on BBQing for, they mentioned that they wanted to have their windows open, that theyd just put some laundry out, and also said that our other neighbour had complained about the smell (this is the first Im hearing of this). I asked if I could start later and we agreed on 2pm.Around 215pm I knocked at my neighbours door to let them know I was going to start cooking, that Id reduce the cook time to 4 hours, and that Id moved the BBQ to the back of the garden. Their response was to tell me that they had looked up on the council website that I was not allowed to BBQ for more than 4 hours, I just said okay and Ive now started my cook. (I havent been able to find anything to backup their claim there is a Council enforced 4 hour limit BBQ limit)I feel Ive done my due diligence by letting them know I was starting and checking their laundry had been taken in, AITA for using my new BBQ?"}, {"title": "WIBTA for telling my daughter to stop being lazy and get her own coffee.", "text": "I love my daughter but at the age of 41 she is so lazy its unbelievable some examples are. She has delivery job which is nice but when she finishes I asks her to run into the store. She answers no I dont feel like walking. When we get home I make her food, She takes the food into the room and eats. When she comes down for a smoke I ask her bring her plate down. Then she says I forgot she goes back upstairs. Then later she comes back downstairs for  another  cigarette With no plate. I ask her to clean the toilets it takes her three months to do it. She only drinks Tim Hortons coffee. Every Sunday and Monday when im off she wakes me up to get HER a coffee. Im 72 and do everything for her I dont think its ridiculous for me to tell her to get her own coffee and stop being lazy WIBTA if i said this"}, {"title": "AITA for refusing to push my obese cousin around in a wheelchair for a day?", "text": "My cousin is approaching six-hundred pounds and requires a mobility scooter, as walking even short distances is very painful for her.  In July, she has an out of state wedding to attend, and I was asked to taxi her to and from the event, as Im not currently employed so my calendar is open.Unfortunately, my car will not carry a mobility scooter, so my cousin will be required to use a wheel chair.  The problem is that this event is being held in a public park.  I can barely push her wheelchair on a paved surface, let alone across grass and dirt.  I tried contacting a couple rental agencies in the area but they would not lease scooters in this case because of the off-road use.  My aunt and uncle have also declined to loan me their truck, which is how my cousin normally gets around, because I have a pretty shitty driving history.I did look into renting a vehicle that could carry the scooter, but my cousin cannot afford to pay for that and obviously with me being jobless, I cant either.The distance from parking to the event area is about forty-yards, which my cousin cannot handle walking.  About the best solution anyones come up with is that the party has a flat bed theyre using to tote supplies from the cars, but my cousin says she would feel humiliated having to be rolled in like that.My cousin is furious with me, saying Im shaming her by saying I cannot push her, but I feel its the honest truth.  Like 100% the thin wheels of the wheelchair are going to dig into the ground, and I am not strong enough to handle that.  My cousin has done a lot for me in the past, so I do feel bad saying no, but I feel like Ive looked into every option at this point.  AITA for not being willing to just go and give it the college try?Also, please dont degrade my cousin.  I know I cant stop you, but its all been said before.  Please and thank you."}, {"title": "AITA for not asking my SIL if it was okay for her 17 year old daughter to act in my sons homemade horror movie?", "text": "Such a weird title and a sentence I never thought I would have to type, haha. I have 4 kids (18M, 17M, 13F, 10M). It was the first week of summer vacation for my kids and since we live near the beach, my niece (17F) asked to come over for the weekend. Shes an only child and likes being around our kids. My 18 year old son is really into the horror genre. He loves horror books, movies, tv shows, the whole 9 yards. His room is decorated with horror posters and funko pops. Its no secret to anyone and he also enjoys making horror films with his siblings. This is no secret to anyone either. With my niece sleeping over the kids decided to make a horror film last night while my husband and I were out on a date. They showed it to us when we got home and I thought nothing of it. My son posted it on his Instagram, my SIL saw it, and called me saying that I shouldnt have allowed her daughter to participate in the film because it involved the paranormal. She was so pissed that she wanted to come get her daughter but I talked her off the ledge because my niece really wants to stay for the remainder of the weekend. My niece is 17 and will be a senior in high school. She enjoyed making the movie and didnt say anything to anyone about not being allowed. My SIL never said anything either and she knows my son makes these movies. She said she assumed we would know better than to allow another kid to be involved in this. Its got me wondering if I am the asshole?Edit There seems to be some confusion. My SIL was not upset about it being on social media. She was upset about it being related to the paranormal. And no, we do not let our kids post random people on social media. I am not sure what I said to imply that but we dont do that."}, {"title": "AITA for asking my sister to please stop bringing up her stepgrandkids names to me?", "text": "The title might be a little confusing so let me begin.My sister Mary is married to Derek and she is the stepmother to his four children from his late wife. They are all in their mid 20s to early 30s now. All of them are married with children. Dereks first wife passed away while the children were still very young (7 and under) and Mary and Derek met 18 months later and married 10 months after that. Mary always adored her stepkids and she strived for them to have a close relationship and it does appear to be pretty alright. They treat her respectfully and they dont try to exclude her from any big moments in their lives. But I also acknowledge that they do keep an emotional distance from her and seem almost afraid to get too close. Like theyll dishonor their mom if they get close to Mary.Something this has really shown in is their children. There are 11 grandchildren between the four kids and each and every one has some part of their name honoring their mom or their dad. Mostly its the middle names where these honors happen but two of them have first names honoring their late mother. The other sides of the childrens families are not represented in the names from what Mary and Derek were told.So it hurt Mary that of all the grandkids, they made the effort with each one to honor one of their bio parents in some way but not her. I think it especially hurt her for the younger two kids to do this because she raised them from very young ages. She has confessed it mostly bothers her because her husband also gets honored and they go out of their way to do it in different ways with each grandchild. She has been talking to me about it a lot lately. I didnt mind her coming to me for a shoulder to cry on at first. But for six months now I have listened to her bring this up dozens of times. She doesnt want to complain to her husband or her stepkids so Im the safe space to do so. I just dont want to keep hearing about this indefinitely. So I gently asked Mary to please stop talking about this as often. I suggested a therapist if she really needs someone to speak to openly about this on a frequent basis but I told her its starting to weigh on our relationship because we talk about her stepgrandkids names more than anything else. Mary was upset and told me shed stop. But she wasnt happy about it and she has been different with me ever since. She even snapped at me the other day and I suspect this is coming from what I said.AITA?"}, {"title": "My daughter has been doomscrolling for fourteen hours.", "text": "I had heard a knock on the door.But when I opened it......No one was there.I looked around......Nothing.Then I looked down......And saw it.Lying there on the doorstep, was an old cell phone with a cracked screen.I picked it up and clicked the home button.It opened without a passcode, revealing a home screen with only one app.Rebecca? I called out to my eighteen year old daughter, as I stepped back inside and closed the door behind me. You know anything about the cell phone I just found on the doorstep?On the doorstep? She called back from the living room, likely scrolling away on her own phone.Yeah, with a big crack in it?Nope.I guess Ill just throw it out then.Wait! I wanna see! She cried out, her curiosity peaked, as she made her way over to the kitchen.I held it up for her to see.Ew. Looks old. Like from when you and mom were growing up.When your mom and I were growing up, there were no cell phones, Becca.Sounds boring.Yeah, it was. Perfectly boring. In the best way possible. Now look at whats become of the world.Yeah yeah, let me see it. She said, snatching the old cracked cell phone out my hand. Whats the passcode?There isnt one.She opened it.Just one app? This phone is so mid.Mid? I asked, unfamiliar with her Gen-Z slang.It means like mediocre, dad. Whered you find this thing, anyway?I told you, on the doorstep. Someone knocked and ran away.So its some sort of prank?If it is, its a pretty mid prank. I replied, giving her the same smug look I always did when I landed a dad joke.Ew, your jokes are not funny, Dad. Anyways, Im gonna see whats in the app. Rebecca said, as she scurried off back to the living room, and proceeded to scroll away on the cracked old phone.Cool, let me know what you find, Becca. I said casually, as I sat back down at the dinner table and continued reading my newspaper.An hour or so later, my wife Erica returned home from work, and we had dinner.Rebecca, its dinner time! Erica called out from the kitchen.But my daughter didnt reply.Becca? I added.But again, Rebecca ignored us.My wife and I both looked at each other and rolled our eyes.Your loss! Foodll be cold again. Erica said, referring to the countless other times our social media-obsessed teen had forgone dinner so long that the meal had become cold.Kids. I muttered under my breath. So how was work, honey?--A few hours later, my wife and I decided to go upstairs for the night and, seeing that Rebecca was still scrolling away on the couch, reminded her that her dinner was on the table.Once again, our daughter just ignored us, as she continued to scroll away on her phone. Something that, after raising an eighteen year old daughter, I was very used to.But this time, something was different. This time, she was scrolling on a different phone. The old cracked phone I had found on the doorstep, to be precise.*Shes still using that old thing? Wonder what app was on there? Must be some game or social media thing.* I thought to myself.Just remember to turn the lights out before you go to bed, Becca. My wife called down, before we retired to our bedroom, to no reply.--But the next morning, not only did we find the lights on, but we also found Rebecca still sitting there. Sure enough, scrolling away on the old cracked phone.Rebecca! My wife called out. Did you even sleep last night?Yeah, Becca, you really shouldnt be pulling all nighters like that. I added, as I went to the kitchen to put on a pot of coffee.But before I could make it that far, something caught my eye on the kitchen table.To my disbelief, there was Rebeccas dinner. Still sitting there. Completely untouched.Thats when I knew......That something was very wrong.--By the time my wife and I were able to pry the old cracked cell phone out of our daughters hands, Rebecca had gone into a sudden fit of rage.Give it back! She screamed, her eyes cold and lifeless.I tossed the phone to Erica behind me, while I stood between her and our daughter.I said, give it back! Rebecca screamed again, in a threatening fashion.Becca, whats gotten into you? Its just an old phone. And a cracked one at that- I began.But before I could continue, my innocent daughter, who had never laid a finger on a soul her entire life, suddenly lunged at me, swung her arm, and ran her nails across my face, tearing the flesh from my skin and causing blood to pour down my neck.Rebecca! I yelled, raising my voice.But it was too late. She had already hopped over me and chased my wife into the kitchen.--When I finally caught up to her at the entrance to the kitchen, I saw my daughter standing there with a steak knife, on one side of the kitchen table, while my wife stood on the other, shaking in fear, as she held the old cracked phone in her hand.What was on that app? I asked hypothetically out loud, realizing that whatever my daughter had discovered on the phone, must have been the cause of her fourteen hour doomscroll and subsequent fit of rage.But Erica must have taken me literally, immediately opening the phone and going to the app.I saw a perplexed look wash over my wifes face, as she took her finger, placed it on the phones cracked surface, and started to scroll.Nooo! Erica, stop! I cried out, as I ran over to her, and ripped the phone from her hand.But before I could even process what had happened, I heard the steak knife that my daughter was holding fall to the kitchen floor, before she too collapsed to the ground.Becca? I asked, confused by her sudden change of disposition, but at the same time, relieved that her fit of rage had ceased.Thats when I heard a growl behind me, as my daughters rage had somehow shifted to my wife, and Erica picked up the knife from the floor.Give. It. Back! My wife screamed, her eyes now cold and lifeless.I looked down at my daughter, who looked as if she had just awoken from a trance.Thats when I realized that whatever curse had been bestowed upon the old cracked phones app, seemed to only affect the last person who used it.I took my dazed daughter by the hand, and led her out of the kitchen, out of the house, and to the driveway, as my wife followed, still wielding the knife.Get in! I insisted, as I opened my car door, and Rebecca hopped inside, before I used my key fob to lock her inside.Give me the phone! My wife cried from behind me, as she swung the knife at me.I stepped aside, and watched its blade pierce the hood of my car.I thought to call out my wifes name, in an attempt to snap her out of it, but immediately realizing that there was only one way to snap her out of her trance.As she struggled to pull the blade out of the car, I seized the opportunity to run back in the house and turn on the sink in the first floor bathroom.Eventually, my wife came back inside looking for me and, sure enough, headed for the source of the running water.And when she stepped inside, I hopped out from behind the kitchen island, slamming the door behind her, before dragging a nearby bookshelf against the door and reinforcing it with a few other heavy objects.Give me the phone! I heard her cry out from inside the bathroom, as I looked at the old cracked cell phone that I was still gripping in my hand, and knew what I had to do.--Thirty minutes later, the deed was done.The old cracked cell phone, left on a random neighbors doorstep in the next town over, where I hoped no one would recognize me.When I got back to the car, my daughter was just sitting there in the passenger seat, still traumatized and speechless from what she had just gone through.We drove home in silence.And when we finally got back, we waited by the barricaded bathroom door, as my wife continued to scream.And waited.And waited.Until eventually......She stopped.I slid the heavy objects and bookshelf aside and opened the bathroom door, to find Erica just standing there, as if waking from a bad dream, the same exhausted expression on her face that Id seen previously on my daughter.It had worked. My wife was no longer possessed by the vile device.Erica walked over and hugged me.I looked over at my daughter.She smiled.I smiled back.In that moment, two things became clear.One, someone else had been possessed by the phone prior to leaving it on my doorstep.Two, someone new was possessed by it now.But all that mattered to me in that moment......Was that my family was okay.I wish I could say that after the dust settled, my daughter swore off cell phones, social media, and apps altogether.But the truth is, it only took a day before she was back to doomscrolling on her own phone.Now every time she does, and her dinner gets cold, I cant help but fear that shes been possessed again, but then I realize......Shes just a teenager."}, {"title": "The Forgotten Tunnel", "text": "Living in a small town, you often hear whispers about old, forgotten places. There was one tale that always intrigued me the story of the Forgotten Tunnel. Located deep within the woods, it was said to be part of an abandoned mining operation, long since sealed off due to mysterious disappearances.One cool, misty evening, curiosity got the better of me. Armed with only a flashlight and a sense of adventure, I set off to find the tunnel. The path through the woods was overgrown and barely visible, the trees closing in around me like skeletal hands.After an hour of trudging through the underbrush, I found it--a rusted, ancient gate barely hanging on its hinges. Beyond it lay the entrance to the tunnel, a yawning maw of darkness that seemed to swallow all light. The air grew colder as I approached, a chill that seemed to seep into my bones.I hesitated only for a moment before stepping inside. The tunnel walls were damp and covered in mold, the air thick with the smell of decay. My flashlight flickered, casting eerie shadows that danced and twisted. The deeper I went, the more oppressive the darkness became, until it felt like a living, breathing entity pressing in on me.Halfway through, I stumbled upon an old mining cart, its wheels rusted and immobile. Inside it were remnants of old tools, long abandoned by their owners. I felt a shiver run down my spine as I imagined the miners who had once worked here, now lost to time and memory.Just then, I heard it--a faint whisper, almost imperceptible, echoing through the tunnel. It sounded like a voice, but distorted, as if carried from a great distance. I stopped, straining to hear. The whisper grew louder, more insistent, and I realized it was calling my name.Panic set in, but my feet seemed glued to the spot. The whisper became a chorus, a cacophony of voices all chanting my name. I swung my flashlight wildly, the beam cutting through the darkness but revealing nothing. The tunnel seemed to close in around me, the walls narrowing as the voices grew louder.I turned to run, but the tunnel had changed. The entrance was gone, replaced by solid rock. The whispers turned into screams, a thousand tortured souls crying out in agony. My flashlight flickered and died, plunging me into complete darkness. The screams were deafening now, reverberating through the tunnel and shaking me to my core.I ran blindly, my hands scraping against the rough walls. The tunnel twisted and turned, disorienting me until I didnt know which way was forward. My breath came in ragged gasps, my heart pounding in my chest. Just when I thought I couldnt take it anymore, I stumbled and fell, crashing to the ground.When I opened my eyes, I was outside. The entrance to the tunnel loomed behind me, silent and foreboding. I scrambled to my feet and ran, not stopping until I was safely back in town. I told my story to anyone who would listen, but they all laughed it off as a hallucination, a trick of the mind.But I know what I heard, what I felt. The Forgotten Tunnel is not just a relic of the past. It is a living, breathing entity, a trap for the curious and the unwary. I can still hear the whispers sometimes, in the dead of night, calling my name. The tunnel is always there, waiting, and I know it wont let me escape forever."}, {"title": "AITA for refusing to let my partners friend in the apartment?", "text": "My girlfriend has a few close friends. Ive met all of them and get on with most of them. There was one friend that I had met a few times and got on well with. Me, my partner and this friend went out for drinks around 2 months ago. The friend was quite shy and socially awkward.She thanked me for being nice to her and understanding she wasnt extroverted etc and takes a while to be comfortable around people. I told her not to worry and that Im not going to judge her for being shy when I used to be really shy when I wsa younger. As the night went on things were going well until one point when my gf went to the toilet at one of the bars.The friend got closer to me and tried to kiss me. I backed off before she managed to get close enough and told my gf straight away. Me and my gf left the bar and went home. For a couple of weeks they didnt speak but my gf decided to hear her out and went to meet up with her.They talked things through and this friend apologised to my gf and told her to apologise to me aswell. My gf said theyre working on mending their friendship and have been meeting up again. A couple of weeks ago my girlfriend said she was thinking of the three of us going for drinks again but I refused. I said I think its odd shes still friends with her but I cant control her friend but what I can control is who Im around and I dont want to be around her. My girlfriend said I was overreacting and the friend is sorry. Last week my gf mentioned doing a movie night with this friend and asked if I would be home. I told her I was and that I dont want the friend in the apartment. My gf said I could always go out for the evening but I refused and just said if she wants a movie night she can go to her friends because I dont want her friend in our apartment. My gf said I was overreacting again and should be fine with her friends coming round but I refused to change my mind.AITA for refusing to let my girlfriend friend in the apartment?"}, {"title": "Force me to wear a dress? You won't like what you see.", "text": "[TLDR AT THE END]Hello, this happened two months ago but I only thought of posting it now. (Warning it's a little long because I talk too much)First, a little contextbackstoryI, a 19 y.old man, am a severely closeted trans man (ftm). I recently moved to the US from Africa (I will not specify where for safety reasons) to study abroad. In reality, I moved in hopes of escaping the anti-lgbt laws and the sad reality of being queer in Africa. I hoped in America I could find a future where I could truly live as myself. Spoiler Alert, I didn't. Not only does it seem like America hates trans people as much as Africa, but also, my family here seems to be 10 times more strict, closed minded, and traditional than my family back home. For those who don't know, being an international student is expensive as heck. My family is not poor, but we are not covered in wealth either. So, to be able to live here, I needed to move in with my family in America, at least for the time being.Now, to the actual story.A year ago, my cousin graduated from community college and was going to transfer to another University to complete their degree. We are all taking this route because it's cheaper. Naturally, we all had to attend said graduation. And people from immigrant families can probably relate, but my family insisted on being well dressed (overdressed) for the occasion. I hate dresses with all my heart. I have hated them for as long as I can remember, even long before I realized I was trans. I hate how I look, I hate how they make me feel, and it feels like im on the verge of a panic attack every time I'm forced to wear one, especially in public.You can probably tell where this is going. I was forced to wear one for the graduation. You cannot fight or talk back to your elders in my culture. No matter how old you are. I tried to protest as much as possible, but the decision was final. I genuinely wanted to *unalive myself* that day. Anyways, this year was my graduation. And I knew since last year that the same thing will proceed. My family will ask me what I have to wear for my graduation, and even if I had a perfectly nice suit that was appropriate for the occasion, they'll force me to go dress shopping and wear one to it.But this year, I came prepared. I didn't mention it earlier, but for over a year and a half now I've been on a weight loss and body building journey.In fact, the whole incident last year has made me double down and workout even harder. Losing weight and building muscle has been a way to help me manage my body dsyphoria. Not only do I now look more masculine, but I look pretty cool with muscles too. Like said earlier, my family is very traditional. So, they live by certain gender expectations. And one thing they absolutely hate is masculine girls and feminine boys.  They hate muscular girls with a burning passion, saying it looks ugly or unatural. So this year, when they brought up dress shopping for my graduation, I didn't even put up a fight. I went along like nothing was wrong.While dress shopping, I purposely picked the most tight fitting dresses, sleeveless ones and even unattractive ones.  I've been able to hide my body progress this whole time by only wearing loose and baggy clothes around the house.So, when it came time to try on the dresses, and I came out of the dressing room, the pure look of disgust on their faces is one I cannot describe. I had to try so hard to not burst out laughing in the moment. While I am not the most muscular person out there, I still looked pretty buff in those dresses. Simply put, I looked like a man in those dresses. And they hated that HAHAHAHA.The worst part is that they could not even complain about my body, because my weight has always been an \"issue\" and talking point in my family. So, even though they hated how I looked, at least I lost weight, so they cannot complain.I was even considering lat spreading as I came out of the dressing room, but that might have pushed it too far.Anyway, long story short, they hated every single dress and allowed me to wear my suit (which I looked much better in). And now, even though I won, I constantly get comments about working out too much from them.On the bright side, since I graduated, I am finally moving out after summer. Hopefully, with more freedom and less fear, things will be different this time )TLDR My traditional family forced me, a (closeted) trans man, to wear a dress for my graduation. But I became really buff over the year to look like a man in a dress. It worked and they hated it. "}, {"title": "AITA My boyfriend is threatening to dump me after a $300 dinner ", "text": "My boyfriend (34) and me (31) have only been together for 5 months now. I'm not a big foodie and don't eat seafood or sushi but he does. He hit his quarterly goal at work so I decided to surprise him by taking him to a super high end sushi restaurant, one he had mentioned several times he was dying to go to but due to my picky eating habits he normally chooses places we'd both enjoy and I know he wished to eat more of his favorite things. I dressed up super nice in a long skirt, blouse and heels and even got my hair done for the surprise. It wasn't very busy as we went on a Tuesday. I will admit I don't know how to use chopsticks and have only tried maybe twice ever. Well I accidentally dropped one of them, a waiter quickly came over and I asked if I could have a fork. From what I knew he enjoyed the dinner and he was all smiles and grateful. He even thanked me for trying food he knew I wasn't fond of. The bill came and I paid - it was around $300 which isn't super important but am adding for context for how nice this place was. After I paid i asked if he wanted to keep the night going and that's when he bluntly said no I think it's better for me to take you home. The next few days he was distant and I reached out asking if he was oki. He said no and that I embarrassed him and he's second guessing our relationship. I asked why and he said he would never want to go somewhere nice with me again because I dropped my chop sticks and that everyone stared at us and he was beyond humiliated. I'm so confused because because we were 1 of maybe 4 couples and it happened so quickly and from what I saw, no one even looked our way. I apologized for embarrassing him and he said he doesn't care because I already ruined any future chance of us going somewhere nice again because he can't trust that I won't make a fool out of myself. He then got pretty nasty saying I was sloppy and a mess and not the classy woman he thought I was. I told him im no longer sorry because he is overreacting and that it was a simple mistake that no one else would even remember because there were so many other highlights and positive aspects of the night. He's saying im selfish and a bad girlfriend and doesn't know if he's willing to continue the relationship. Am I the asshole for thinking this is super extreme for an innocent mistake? I never expected a 2 second human error would turn into a possible breakup. "}, {"title": "AITA for telling my grandmother that she needs to quit pestering me before I pursue legal action?", "text": "This is complicated af (potentially) so Ill try to make it simple. My parents were separated when my mom died when I (19m) was 7. My father had an alcohol problem and refused to get help so mom left. He did not try to see me in the four months of us not living together. Then my mom was involved in a car accident and died. I was placed with my father initially but his continued drinking led to my maternal grandparents getting custody of me.My father had a kid with someone else while I lived with my grandparents. This child somehow ended up in his sole care. I ended up living with my father again not too long after. He was still drinking and generally a lot more shitty when I was returned to his care. But he hid his drinking a lot better. When his next kid was born and the mother of said kid was arrested and shit hit the fan I was again placed with my grandparents but only for a month. Went back to my father. He had two other kids in his care. A third joined 20ish months later. None of the mothers were involved. One is still in jail as far as I know. I dont know the other two. His mother was never around, never involved, I never met her in all that time or when my mom was alive.2 years ago my father died. His mother arrives to take his other children while I went home to my grandparents. My grandmother wanted me but the social worker agreed that I should be with family I know. They tried to keep me in touch with my fathers other kids but I never felt anything for them, never cared to have a relationship and made my intentions known that I would cease all contact as soon as I was 18. So they only forced two visits before nothing else. I did not keep in touch with this grandmother after that point. She tried but I ignored her.Six months ago she reached out with a new phone number and told me she wanted me to be around her and the kids, that they needed a good solid male role model and Im their brother whether I want to acknowledge it or not. I told her I would not be a good male role model for them because I do not want to know them and would never show them love or affection or care. She claimed I should do it for her as my grandmother and I told her I had met her twice before and that was after my father died, not before, so I owed her nothing. She has contacted me dozens of times since then. I have it documented. I need at least 8 months for it to be something I can pursue legally (I went to a few lawyers to ask). So I decided to reach out once and I texted her that she needs to quit pestering me and forget my number and any contact info for me because I do not want contact with her or them and better stop before I pursue legal action.She responded that I was a cold-hearted, cruel, son of a bitch who should be ashamed of myself for treating her and them this way when they did nothing to me but exist.AITA?"}, {"title": "Photos while sleeping", "text": "The other night i went to sleep around 2 am. I woke up the next morning and it was my friends birthday so i looked at my photos to see if i have one to post. I noticed the first three recent photos i dont remember taking. For context i sleep alone in my home with my dog in the kennel outside my room. I have no led lights or any lights on in my room when i sleep. The 3 photos were taken at 430 am. The first one was a black screen with a luminous red squiggled line, with large red spots around it. The second was a flash photo of my blinds. The third was a flash photo angled down at me sleeping with only my leg and bed in the frame. The two of me sleeping i have convinced myself i did it in my sleep. But i cannot explain the red line. The next day i slept with my dog in my room. At the same time at night he began barking and growling at my tv in my room. I turned the light on and he stopped. I comforted him and then took him outside. When i got back into my room with my dog i turned the lights off and then got back into bed and he stated barking at the same thing. I tested to see if maybe it was his reflection but my room is so dark nothing reflects off the tv. I have been sleeping with a rosary around my neck and it seems to be working but maybe im just paranoid. Any advice?Shortened Weird photos taken of me and my room while i was sleeping alone. The next day my dog barked at nothing in the darkBelow is just so it reaches 500 word minimumThe other night i went to sleep around 2 am. I woke up the next morning and it was my friends birthday so i looked at my photos to see if i have one to post. I noticed the first three recent photos i dont remember taking. For context i sleep alone in my home with my dog in the kennel outside my room. I have no led lights or any lights on in my room when i sleep. The 3 photos were taken at 430 am. The first one was a black screen with a luminous red squiggled line, with large red spots around it. The second was a flash photo of my blinds. The third was a flash photo angled down at me sleeping with only my leg and bed in the frame. The two of me sleeping i have convinced myself i did it in my sleep. But i cannot explain the red line. The next day i slept with my dog in my room. At the same time at night he began barking and growling at my tv in my room. I turned the light on and he stopped. I comforted him and then took him outside. When i got back into my room with my dog i turned the lights off and then got back into bed and he stated barking at the same thing. I tested to see if maybe it was his reflection but my room is so dark nothing reflects off the tv. I have been sleeping with a rosary around my neck and it seems to be working but maybe im just paranoid. Any advice?Shortened Weird photos taken of me and my room while i was sleeping alone. The next day my dog barked at nothing in the darkThe other night i went to sleep around 2 am. I woke up the next morning and it was my friends birthday so i looked at my photos to see if i have one to post. I noticed the first three recent photos i dont remember taking. For context i sleep alone in my home with my dog in the kennel outside my room. I have no led lights or any lights on in my room when i sleep. The 3 photos were taken at 430 am. The first one was a black screen with a luminous red squiggled line, with large red spots around it. The second was a flash photo of my blinds. The third was a flash photo angled down at me sleeping with only my leg and bed in the frame. The two of me sleeping i have convinced myself i did it in my sleep. But i cannot explain the red line. The next day i slept with my dog in my room. At the same time at night he began barking and growling at my tv in my room. I turned the light on and he stopped. I comforted him and then took him outside. When i got back into my room with my dog i turned the lights off and then got back into bed and he stated barking at the same thing. I tested to see if maybe it was his reflection but my room is so dark nothing reflects off the tv. I have been sleeping with a rosary around my neck and it seems to be working but maybe im just paranoid. Any advice?Shortened Weird photos taken of me and my room while i was sleeping alone. The next day my dog barked at nothing in the dark"}]